# 01. import libraries and data frames

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
path = r'C:\Users\Bradley Allen\Desktop\Instacart Basket Analysis'

In [3]:
path

'C:\\Users\\Bradley Allen\\Desktop\\Instacart Basket Analysis'

In [4]:
# 03. new nb, importing data frames
df_ords_prods_comb = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [7]:
df_prods_clean = pd.read_csv(r'C:\Users\Bradley Allen\Desktop\Instacart Basket Analysis\02 Data\Prepared Data\products_clean.csv', index_col = False)

In [5]:
# 04. check shape of imported dataframes
df_ords_prods_comb.shape

(32434489, 11)

In [8]:
df_prods_clean.shape

(49672, 6)

In [9]:
df_ords_prods_comb.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [10]:
df_prods_clean.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [ ]:
# removing extra columns

In [11]:
df_prods_clean = df_prods_clean.drop(columns = ['Unnamed: 0',])

In [12]:
df_prods_clean.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [15]:
df_ords_prods_comb_1 = df_ords_prods_comb.drop(columns = ['_merge',])

In [16]:
df_ords_prods_comb_1.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,True,196,1,0
1,2539329,1,1,2,8,NaN,True,14084,2,0
2,2539329,1,1,2,8,NaN,True,12427,3,0
3,2539329,1,1,2,8,NaN,True,26088,4,0
4,2539329,1,1,2,8,NaN,True,26405,5,0

In [ ]:
# 05. detemine how to merge the dataframes

In [17]:
df_ords_prods_merged = df_ords_prods_comb_1.merge(df_prods_clean, on = ['product_id'], how = 'left', indicator = True)

In [ ]:
# 06. confirm results with the merge flag

In [18]:
df_ords_prods_merged['_merge'].value_counts()

both          32404859
left_only        30200
right_only           0
Name: _merge, dtype: int64

In [19]:
# 07. export newly created df as orders_products_merged in suitable format
df_ords_prods_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_prodcts_merged.pkl'))